18.5-rails-review/lecture-kit/app/views/employees/_form.html.erb

<%=f.label :dog_id%>
<%=f.collection_select :dog_id, Dog.all, :id, :name%>
---
SELECT "dogs".* FROM "dogs"