18.5-rails-review/done-kit/app/controllers/employees_controller.rb

INSERT INTO "employees" ("first_name", "last_name", "alias", "title", "office", "dog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      if @employee.create(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 20]]
---
    def destroy
      @employee = Employee.destroy(params[:id])